task_management/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def authenticate_request
      token = request.headers['Authorization']&.split(' ')&.last
      decoded_token = decode_token(token)
      @current_user = User.find(decoded_token[:user_id]) if decoded_token