task_management/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---
  def set_task
    @task = current_user.tasks.find(params[:id])